#include<stdio.h>
#include<stdlib.h>

void userMenu(){
	printf("######################用户######################\n");
	printf("#              请输入您想要实现的功能          #\n");
	printf("#                     [1] 存款                 #\n");
	printf("#                     [2] 取款                 #\n");
	printf("#                     [3] 转账                 #\n");
	printf("#                     [4] 查询余额             #\n");
	printf("#                     [5] 修改密码             #\n");
	printf("#                     [6] 修改用户信息         #\n");
	printf("#                     [0] 退出系统             #\n");
	printf("######################用户######################\n");
	return;
}

//不知道如何，先显示登录注册，登录成功后，再进行后续操作
void sign_loginMenu(){
	printf("######################用户######################\n");
	printf("#                 请输入您的操作               #\n");
	printf("#                     [1] 注册                 #\n");
	printf("#                     [2] 登录                 #\n");
	printf("#                     [0] 退回上一个界面       #\n");
	printf("######################用户######################\n");
}

void adminMenu(){
	printf("#####################管理员####################\n");
	printf("#              请输入您想要实现的功能         #\n");
	printf("#                [1] 查看所有用户             #\n");
	printf("#                [2] 查看单个用户             #\n");
	printf("#                [3] 查看银行整体金额变化     #\n");
	printf("#                [4] 修改用户密码             #\n");
	printf("#                [0] 退出系统                 #\n");
	printf("#####################管理员####################\n");
}

void admin_sign_loginMenu(){
	printf("######################管理员####################\n");
	printf("#                     请先登录                 #\n"); 
	printf("#                     [1] 登录                 #\n");
	printf("#                     [0] 退回上一个界面       #\n");
	printf("######################用户######################\n");
}

void menu(){
	printf("##############菜单##############\n");
	printf("#            [1]用户           #\n");
	printf("#            [2]管理员         #\n");
	printf("#            [0]退出           #\n");
	printf("##############菜单##############\n");
	return;
}